Repository: soul99soul-glitch/AmberNovel-iOS
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# 「%@」想调用当前聊天模型生成文本。
source: “%@” wants to generate text with the current chat model.
ja: 「%@」が現在のチャットモデルを呼び出してテキストを生成しようとしています。
ko: 「%@」이(가) 현재 채팅 모델을 호출해 텍스트를 생성하려고 합니다.
ru: «%@» хочет вызвать текущую модель чата для генерации текста.
zh_hans: 「%@」想调用当前聊天模型生成文本。
zh_hant: 「%@」想呼叫目前聊天模型產生文字。

# 「%@」首次请求：%@ 允许后可继续使用，拒绝后会记住本次选择。
source: First request from %@: %@ Allow to continue; if denied, this choice will be remembered.
ja: 「%@」からの初回リクエスト：%@ 許可すると引き続き利用でき、拒否すると今回の選択が記憶されます。
ko: 「%@」의 첫 요청: %@ 허용하면 계속 사용할 수 있으며, 거부하면 이번 선택을 기억합니다.
ru: «%@» первый запрос: %@ После разрешения можно продолжить использование; отказ запомнит этот выбор.
zh_hans: 「%@」首次请求：%@ 允许后可继续使用，拒绝后会记住本次选择。
zh_hant: 「%@」首次請求：%@ 允許後可繼續使用，拒絕後會記住本次選擇。

# 一次最多发送 %lld 张图片
source: You can send at most %lld images at a time
ja: 一度に送信できる画像は %lld 枚までです
ko: 한 번에 최대 %lld장의 이미지를 보낼 수 있습니다.
ru: За раз можно отправить не более %lld изображений
zh_hans: 一次最多发送 %lld 张图片
zh_hant: 一次最多傳送 %lld 張圖片

# 一次最多附加 %lld 个文件
source: Attach up to %lld files at a time
ja: 一度に添付できるファイルは最大%lld個
ko: 한 번에 최대 %lld개 파일 첨부
ru: За один раз можно прикрепить не более %lld файлов
zh_hans: 一次最多附加 %lld 个文件
zh_hant: 一次最多附加 %lld 個檔案

# 一起商量，你点收录才进书
source: Discuss together; you decide what goes into the book
ja: 一緒に相談し、収録をタップして本に追加
ko: 함께 논의하고, 수록을 눌러야 책에 들어갑니다.
ru: Обсуждаем вместе; в книгу попадёт только то, что вы добавите
zh_hans: 一起商量，你点收录才进书
zh_hant: 一起討論，你點收錄才會進書

# 上一批已全部完成并收录。点「代笔下一批」继续连写，或修改章数后再开始。
source: The previous batch is complete and fully adopted. Tap “Ghostwrite next batch” to continue, or change the chapter count before starting again.
ja: 前のバッチはすべて完了し、収録済みです。「次のバッチを代筆」をタップして続けて執筆するか、章数を変更してから開始してください。
ko: 이전 배치가 모두 완료되어 수록되었습니다. 「다음 배치 대필」을 눌러 이어서 작성하거나 장 수를 수정한 후 다시 시작하세요.
ru: Предыдущая партия полностью завершена и добавлена. Нажмите «Дописать следующую партию», чтобы продолжить, или измените число глав и начните заново.
zh_hans: 上一批已全部完成并收录。点「代笔下一批」继续连写，或修改章数后再开始。
zh_hant: 上一批已全部完成並收錄。點「代筆下一批」繼續連寫，或修改章數後再開始。

# 上一批已完成。在下方「代笔」区点按钮开始下一批。
source: The previous batch is complete. Tap the “Ghostwrite” section below to start the next batch.
ja: 前のバッチは完了しました。下の「代筆」欄のボタンから次のバッチを開始してください。
ko: 이전 배치가 완료되었습니다. 아래 「대필」 영역의 버튼을 눌러 다음 배치를 시작하세요.
ru: Предыдущая партия завершена. Нажмите кнопку «Дописать» ниже, чтобы начать следующую.
zh_hans: 上一批已完成。在下方「代笔」区点按钮开始下一批。
zh_hant: 上一批已完成。在下方「代筆」區點按鈕開始下一批。

# 上一章
source: Previous chapter
ja: 前の章
ko: 이전 장
ru: Предыдущая глава
zh_hans: 上一章
zh_hant: 上一章

# 上一章尾
source: End of previous chapter
ja: 前章の末尾
ko: 이전 장 끝
ru: Конец предыдущей главы
zh_hans: 上一章尾
zh_hant: 上一章結尾

# 上下文压缩失败：%@
source: Context compression failed: %@
ja: コンテキストの圧縮に失敗しました：%@
ko: 컨텍스트 압축 실패: %@
ru: Сжатие контекста не удалось: %@
zh_hans: 上下文压缩失败：%@
zh_hant: 上下文壓縮失敗：%@

# 上下文段
source: Context segments
ja: コンテキストセグメント
ko: 컨텍스트 구간
ru: Фрагмент контекста
zh_hans: 上下文段
zh_hant: 上下文片段

# 上下文注入
source: Context injection
ja: コンテキスト注入
ko: 컨텍스트 주입
ru: Внедрение контекста
zh_hans: 上下文注入
zh_hant: 上下文注入

# 上下文统计
source: Context stats
ja: コンテキスト統計
ko: 컨텍스트 통계
ru: Статистика контекста
zh_hans: 上下文统计
zh_hant: 上下文統計

# 上下文长度
source: Context length
ja: コンテキスト長
ko: 컨텍스트 길이
ru: Длина контекста
zh_hans: 上下文长度
zh_hant: 上下文長度

# 上传
source: Upload
ja: アップロード
ko: 업로드
ru: Загрузить
zh_hans: 上传
zh_hant: 上傳

# 上次剧情同步未完成。可继续讨论；写正文前请先重试同步。
source: The previous plot sync is incomplete. You can keep discussing; retry sync before writing the manuscript.
ja: 前回のストーリー同期が未完了です。引き続き相談できます。本文を書く前に同期を再試行してください。
ko: 지난 스토리 동기화가 완료되지 않았습니다. 계속 논의할 수 있지만, 본문을 쓰기 전에 동기화를 다시 시도하세요.
ru: Предыдущая синхронизация сюжета не завершена. Можно продолжить обсуждение; перед написанием текста повторите синхронизацию.
zh_hans: 上次剧情同步未完成。可继续讨论；写正文前请先重试同步。
zh_hant: 上次劇情同步未完成。可繼續討論；寫正文前請先重試同步。

# 上次润色还需要处理
source: Previous polish still pending
ja: 前回の推敲でまだ処理が必要
ko: 이전 다듬기에서 처리할 항목이 남아 있음
ru: Нужно продолжить прошлую редактуру
zh_hans: 上次润色还需要处理
zh_hant: 上次潤飾還需要處理

# 下一批
source: Next batch
ja: 次のバッチ
ko: 다음 배치
ru: Следующая группа
zh_hans: 下一批
zh_hant: 下一批

# 下一章
source: Next chapter
ja: 次の章
ko: 다음 장
ru: Следующая глава
zh_hans: 下一章
zh_hant: 下一章

# 下次模型请求才会使用这里的正文，不会写入聊天历史。
source: This content will be used only for the next model request; it won't be written to chat history.
ja: ここに入力した本文は次回のモデルリクエストでのみ使用され、チャット履歴には書き込まれません。
ko: 다음 모델 요청부터 이 본문을 사용하며 채팅 기록에는 저장되지 않습니다.
ru: Этот текст будет использован только при следующем запросе к модели и не попадёт в историю чата.
zh_hans: 下次模型请求才会使用这里的正文，不会写入聊天历史。
zh_hant: 下次模型請求才會使用這裡的正文，不會寫入聊天記錄。

# 下载预览
source: Download preview
ja: ダウンロードプレビュー
ko: 미리보기 다운로드
ru: Скачать превью
zh_hans: 下载预览
zh_hant: 下載預覽

# 不会参与当前试听或聊天朗读；历史配置仅用于保留记录。
source: It won't be used for the current preview or chat read-aloud; the historical configuration is retained for record-keeping only.
ja: 現在の試聴やチャットの読み上げには使用せず、過去の設定を記録として保持するだけです。
ko: 현재 미리 듣기나 채팅 낭독에 사용되지 않으며, 이전 설정은 기록 보관용으로만 유지됩니다.
ru: Не используется для текущего прослушивания или озвучивания чата; исторические настройки хранятся только для справки.
zh_hans: 不会参与当前试听或聊天朗读；历史配置仅用于保留记录。
zh_hant: 不會參與目前試聽或聊天朗讀；歷史設定僅用於保留記錄。

# 不会级联删除它的子分支，但这条分支将不再出现在项目中。
source: Its child branches won't be deleted recursively, but this branch will no longer appear in the project.
ja: 子ブランチは連鎖して削除されませんが、このブランチはプロジェクトに表示されなくなります。
ko: 하위 브랜치는 연쇄 삭제되지 않지만 이 브랜치는 프로젝트에 더 이상 표시되지 않습니다.
ru: Дочерние ветки не будут удалены каскадно, но эта ветка больше не будет отображаться в проекте.
zh_hans: 不会级联删除它的子分支，但这条分支将不再出现在项目中。
zh_hant: 不會連帶刪除其子分支，但這個分支將不再出現在專案中。

# 不单独指定时使用小说创作设置中的默认模型。
source: When none is specified, the default model from the novel-writing settings is used.
ja: 個別に指定しない場合は、小説の創作設定にあるデフォルトモデルを使用します。
ko: 별도로 지정하지 않으면 소설 창작 설정의 기본 모델을 사용합니다.
ru: Если модель не указана отдельно, используется модель по умолчанию из настроек создания романа.
zh_hans: 不单独指定时使用小说创作设置中的默认模型。
zh_hant: 未單獨指定時，使用小說創作設定中的預設模型。

# 不可用
source: Unavailable
ja: 利用不可
ko: 사용할 수 없음
ru: Недоступно
zh_hans: 不可用
zh_hant: 不可用

# 不推翻既有事实，在本章补清称谓、时间或制度差异的原因。
source: Without overturning established facts, clarify the reasons for differences in forms of address, timing, or institutions in this chapter.
ja: 既存の事実を覆さず、この章で呼称・時期・制度の違いの理由を補足する。
ko: 기존 사실은 유지하고, 이 장에서 호칭·시간·제도의 차이가 생긴 이유를 보완합니다.
ru: Не отменяйте установленные факты; в этой главе проясните причины различий в обращениях, времени или устройстве.
zh_hans: 不推翻既有事实，在本章补清称谓、时间或制度差异的原因。
zh_hant: 不推翻既有事實，在本章補充說明稱謂、時間或制度差異的原因。

# 不支持
source: Unsupported
ja: 非対応
ko: 지원되지 않음
ru: Не поддерживается
zh_hans: 不支持
zh_hant: 不支援

# 与小应用交互后会出现最近消息。
source: Recent messages will appear here after interacting with the mini app.
ja: ミニアプリを操作すると、ここに最近のメッセージが表示されます。
ko: 미니 앱과 상호작용하면 최근 메시지가 여기에 표시됩니다.
ru: Последние сообщения появятся после взаимодействия с мини-приложением.
zh_hans: 与小应用交互后会出现最近消息。
zh_hant: 與小應用互動後會顯示最近訊息。

# 与总纲的位置
source: Position relative to the master outline
ja: 全体プロットでの位置
ko: 전체 개요에서의 위치
ru: Позиция относительно общего плана
zh_hans: 与总纲的位置
zh_hant: 與總綱的位置

# 世界观
source: Worldbuilding
ja: 世界観
ko: 세계관
ru: Мироустройство
zh_hans: 世界观
zh_hant: 世界觀

# 世界观、人物、大纲和写作要求都可以独立维护。
source: Worldbuilding, characters, outlines, and writing requirements can each be maintained independently.
ja: 世界観、キャラクター、プロット、執筆要件をそれぞれ個別に管理できます。
ko: 세계관, 인물, 개요 및 작성 요구사항을 각각 관리할 수 있습니다.
ru: Мир, персонажей, план сюжета и требования к стилю можно настраивать отдельно.
zh_hans: 世界观、人物、大纲和写作要求都可以独立维护。
zh_hant: 世界觀、人物、大綱和寫作要求都可獨立維護。

# 严重
source: Severe
ja: 重大
ko: 심각
ru: Критическая
zh_hans: 严重
zh_hant: 嚴重

# 个人数据
source: Personal Data
ja: 個人データ
ko: 개인 데이터
ru: Личные данные
zh_hans: 个人数据
zh_hant: 個人資料

# 临时资料调整
source: Temporary material adjustments
ja: 一時資料の調整
ko: 임시 자료 조정
ru: Изменение временных материалов
zh_hans: 临时资料调整
zh_hant: 臨時資料調整

# 为主要角色建立档案后，收录正文产生的经历会在这里汇总。
source: After profiles are created for the main characters, experiences from the adopted manuscript are summarized here.
ja: 主要キャラクターのプロフィールを作成すると、本文から取り込まれた出来事がここにまとめられます。
ko: 주요 캐릭터의 프로필을 만들면 본문에서 기록된 경험이 여기에 모입니다.
ru: После создания профилей главных персонажей здесь будут собираться события из основного текста.
zh_hans: 为主要角色建立档案后，收录正文产生的经历会在这里汇总。
zh_hant: 為主要角色建立檔案後，收錄正文產生的經歷會在這裡彙總。

# 为每个 WebMount session 显式选择运行后端。
source: Choose an execution backend explicitly for each WebMount session.
ja: 各 WebMount セッションで実行バックエンドを明示的に選択します。
ko: 각 WebMount session에 사용할 실행 백엔드를 명시적으로 선택합니다.
ru: Явно выберите Runtime для каждого сеанса WebMount.
zh_hans: 为每个站点会话显式选择运行后端。
zh_hant: 為每個站點工作階段明確選擇執行後端。

# 主分支
source: Main branch
ja: メインブランチ
ko: 메인 브랜치
ru: Главная ветка
zh_hans: 主分支
zh_hant: 主分支

# 主分支不能直接删除；请先把另一条分支设为主分支。
source: The main branch cannot be deleted directly; set another branch as the main branch first.
ja: メインブランチは直接削除できません。先に別のブランチをメインに設定してください。
ko: 주 브랜치는 바로 삭제할 수 없습니다. 먼저 다른 브랜치를 주 브랜치로 설정하세요.
ru: Главную ветку нельзя удалить напрямую; сначала назначьте главной другую ветку.
zh_hans: 主分支不能直接删除；请先把另一条分支设为主分支。
zh_hant: 主分支無法直接刪除；請先將另一個分支設為主分支。

# 主持人
source: Moderator
ja: モデレーター
ko: 진행자
ru: Модератор
zh_hans: 主持人
zh_hant: 主持人

# 主持人动态生成席位
source: The moderator dynamically generates seats
ja: 司会者が議席を動的に生成
ko: 진행자가 좌석을 동적으로 생성
ru: Ведущий динамически создаёт участников
zh_hans: 主持人动态生成席位
zh_hant: 主持人動態產生席位

# 主持人提示词
source: Moderator prompt
ja: モデレーターのプロンプト
ko: 진행자 프롬프트
ru: Промпт модератора
zh_hans: 主持人提示词
zh_hant: 主持人提示詞

# 主题
source: Topic
ja: テーマ
ko: 주제
ru: Тема
zh_hans: 主题
zh_hant: 主題

# 主题传输失败
source: Theme transfer failed
ja: テーマの転送に失敗
ko: 테마 전송 실패
ru: Не удалось передать тему
zh_hans: 主题传输失败
zh_hant: 主題傳輸失敗

# 事件
source: Event
ja: イベント
ko: 이벤트
ru: Событие
zh_hans: 事件
zh_hant: 事件

# 事件时间线
source: Event timeline
ja: イベントタイムライン
ko: 이벤트 타임라인
ru: Хронология событий
zh_hans: 事件时间线
zh_hant: 事件時間軸

# 事件记录
source: Event log
ja: イベントログ
ko: 이벤트 기록
ru: Запись события
zh_hans: 事件记录
zh_hant: 事件記錄

# 云端 TTS
source: Cloud TTS
ja: クラウドTTS
ko: 클라우드 TTS
ru: Облачный TTS
zh_hans: 云端 TTS
zh_hant: 雲端 TTS

# 云端 TTS 暂未接入
source: Cloud TTS is not yet connected
ja: クラウド TTS は未接続です
ko: 클라우드 TTS는 아직 연결되지 않았습니다.
ru: Облачный TTS пока не подключён
zh_hans: 云端 TTS 暂未接入
zh_hant: 雲端 TTS 尚未整合

# 交互终端是 ExperimentalGPL 的人类前台会话：支持键盘、Ctrl-C 和窗口 resize；切到后台或关闭页面时会停止，不保存或恢复 shell。
source: The interactive terminal is an ExperimentalGPL human foreground session: it supports the keyboard, Ctrl-C, and window resize; it stops when backgrounded or the page closes and does not save or restore the shell.
ja: インタラクティブターミナルは ExperimentalGPL のユーザー向けフォアグラウンドセッションです。キーボード、Ctrl-C、ウィンドウの resize に対応します。バックグラウンドに移行するかページを閉じると停止し、shell の保存や復元は行いません。
ko: 대화형 터미널은 ExperimentalGPL에서 사람이 직접 사용하는 포그라운드 세션입니다. 키보드, Ctrl-C 및 창 resize를 지원하며 백그라운드로 전환하거나 페이지를 닫으면 중지됩니다. shell은 저장하거나 복원하지 않습니다.
ru: Интерактивный терминал — пользовательский сеанс ExperimentalGPL на переднем плане: поддерживаются клавиатура, Ctrl-C и изменение размера окна; переход в фон или закрытие страницы останавливает его, shell не сохраняется и не восстанавливается.
zh_hans: 交互终端是 ExperimentalGPL 的人类前台会话：支持键盘、Ctrl-C 和窗口 resize；切到后台或关闭页面时会停止，不保存或恢复 shell。
zh_hant: 互動終端是 ExperimentalGPL 的人類前景工作階段：支援鍵盤、Ctrl-C 和視窗 resize；切換到背景或關閉頁面時會停止，不會儲存或還原 shell。

# 交接到 iSH
source: Hand off to iSH
ja: iSH に引き継ぐ
ko: iSH로 인계
ru: Передать в iSH
zh_hans: 交接到 iSH
zh_hant: 交接至 iSH

# 交还 Agent
source: Return to Agent
ja: Agentに返す
ko: Agent에 제어권 반환
ru: Вернуть Agent
zh_hans: 交还 Agent
zh_hant: 交還 Agent

# 交还 WebMount 页面给 Agent
source: Return WebMount page to Agent
ja: WebMountページをAgentに返す
ko: WebMount 페이지를 Agent에 반환
ru: Вернуть страницу WebMount Agent
zh_hans: 交还站点页面给 Agent
zh_hant: 將站點頁面交還給 Agent

# 人物关系
source: Character relationships
ja: キャラクター関係
ko: 인물 관계
ru: Связи персонажей
zh_hans: 人物关系
zh_hant: 人物關係

# 人物关系对不上
source: Character relationship mismatch
ja: キャラクター関係が一致しません
ko: 인물 관계가 일치하지 않습니다.
ru: Несоответствие связей персонажей
zh_hans: 人物关系对不上
zh_hant: 人物關係對不上

# 人物姓名
source: Character name
ja: 人物名
ko: 인물 이름
ru: Имя персонажа
zh_hans: 人物姓名
zh_hant: 人物姓名

# 人物建议已生成，确认后才会建档
source: Character suggestions generated; confirm to create records
ja: キャラクター候補を生成しました。確認後に登録されます
ko: 캐릭터 제안이 생성되었습니다. 확인 후에만 등록됩니다.
ru: Предложение по персонажу создано; профиль появится после подтверждения
zh_hans: 人物建议已生成，确认后才会建档
zh_hant: 人物建議已產生，確認後才會建檔

# 人物档案
source: Character profiles
ja: キャラクタープロフィール
ko: 인물 프로필
ru: Профили персонажей
zh_hans: 人物档案
zh_hant: 人物檔案

# 人物角色
source: Characters
ja: キャラクター
ko: 캐릭터
ru: Роль персонажа
zh_hans: 人物角色
zh_hant: 人物角色

# 人物说明
source: Character clarification
ja: キャラクターの説明
ko: 인물 설명
ru: Описание персонажа
zh_hans: 人物说明
zh_hant: 人物說明

# 人物说明后
source: After character clarification
ja: キャラクター説明後
ko: 인물 설명 후
ru: После описания персонажа
zh_hans: 人物说明后
zh_hant: 人物說明後

# 仅 Wi‑Fi 刷新
source: Refresh on Wi‑Fi only
ja: Wi‑Fi接続時のみ更新
ko: Wi‑Fi에서만 새로 고침
ru: Обновлять только по Wi‑Fi
zh_hans: 仅 Wi‑Fi 刷新
zh_hant: 僅限 Wi‑Fi 重新整理

# 仅在使用 Amber 时读取当前位置
source: Reads your current location only while you are using Amber
ja: Amberの使用中のみ現在地を読み取ります。
ko: Amber 사용 중에만 현재 위치를 읽습니다.
ru: Читать текущее местоположение только при использовании Amber
zh_hans: 仅在使用 Amber 时读取当前位置
zh_hant: 僅在使用 Amber 時讀取目前位置

# 仅用于诊断，不影响实际发送。正式发送时会重新计算并留存实际清单。
source: For diagnostics only; it doesn't affect actual sending. The final list is recalculated and recorded when sending.
ja: 診断専用で、実際の送信には影響しません。正式な送信時に実際の一覧を再計算して保存します。
ko: 진단에만 사용되며 실제 전송에는 영향을 주지 않습니다. 정식 전송 시 실제 목록을 다시 계산해 보관합니다.
ru: Только для диагностики, на фактическую отправку не влияет. При обычной отправке список будет пересчитан и сохранён.
zh_hans: 仅用于诊断，不影响实际发送。正式发送时会重新计算并留存实际清单。
zh_hant: 僅用於診斷，不影響實際傳送。正式傳送時會重新計算並保留實際清單。

# 仅重试保存到 Workspace
source: Retry saving to Workspace only
ja: Workspaceへの保存のみ再試行
ko: Workspace 저장만 다시 시도
ru: Повторить сохранение только в Workspace
zh_hans: 仅重试保存到 Workspace
zh_hant: 僅重試儲存至 Workspace

# 仍有未完成的正文或同步操作
source: An unfinished manuscript or sync operation remains
ja: 未完了の本文または同期操作があります
ko: 완료되지 않은 본문 또는 동기화 작업이 있습니다.
ru: Остаются незавершённые операции с текстом или синхронизацией
zh_hans: 仍有未完成的正文或同步操作
zh_hant: 仍有未完成的正文或同步操作

# 从当前 WebMount 页面创建深度阅读
source: Create deep reading from current WebMount page
ja: 現在のWebMountページから詳細リサーチを作成
ko: 현재 WebMount 페이지에서 심층 읽기 만들기
ru: Создать глубокое чтение из текущей страницы WebMount
zh_hans: 从当前站点页面创建深度阅读
zh_hant: 從目前站點頁面建立深度閱讀

# 从文件创建深度阅读
source: Create deep reading from file
ja: ファイルから詳細リサーチを作成
ko: 파일에서 심층 읽기 만들기
ru: Создать глубокое чтение из файла
zh_hans: 从文件创建深度阅读
zh_hant: 從檔案建立深度閱讀

# 从检查点 Fork
source: Fork from checkpoint
ja: チェックポイントからFork
ko: 체크포인트에서 Fork
ru: Fork от контрольной точки
zh_hans: 从检查点 Fork
zh_hant: 從檢查點 Fork

# 从正文目录删除
source: Remove from manuscript index
ja: 本文目次から削除
ko: 본문 목차에서 삭제
ru: Удалить из каталога основного текста
zh_hans: 从正文目录删除
zh_hant: 從正文目錄中刪除

# 从这条创作记录对应的检查点开始
source: Start from the checkpoint for this creative record
ja: この創作記録に対応するチェックポイントから開始
ko: 이 창작 기록의 체크포인트에서 시작
ru: Начать с контрольной точки этой записи
zh_hans: 从这条创作记录对应的检查点开始
zh_hant: 從這筆創作記錄對應的檢查點開始

# 从这里 Fork
source: Fork from here
ja: ここからFork
ko: 여기서 Fork
ru: Fork отсюда
zh_hans: 从这里 Fork
zh_hant: 從這裡 Fork

# 代码模式
source: Code mode
ja: コードモード
ko: 코드 모드
ru: Режим кода
zh_hans: 代码模式
zh_hant: 程式碼模式

# 代码预览
source: Code preview
ja: コードプレビュー
ko: 코드 미리보기
ru: Предпросмотр кода
zh_hans: 代码预览
zh_hant: 程式碼預覽

# 代笔下一批 · %lld 章
source: Ghostwrite next batch · %lld chapters
ja: 次の%lld章を代筆
ko: 다음 %lld개 장 대필
ru: Дописать ещё · %lld гл.
zh_hans: 代笔下一批 · %lld 章
zh_hant: 代筆下一批 · %lld 章

# 代笔下一章
source: Ghostwrite next chapter
ja: 次の章を代筆
ko: 다음 장 대필
ru: Дописать следующую главу
zh_hans: 代笔下一章
zh_hant: 代筆下一章

# 代笔中 · 剧情同步
source: Ghostwriting · Plot sync
ja: 代筆中 · ストーリー同期
ko: 대필 중 · 스토리 동기화
ru: Пишет · синхронизация сюжета
zh_hans: 代笔中 · 剧情同步
zh_hant: 代筆中 · 劇情同步

# 代笔中%@ · 写整章
source: Ghostwriting%@ · Full chapter
ja: 代筆中%@ · 章全体を執筆
ko: 대필 중%@ · 전체 장 작성
ru: Пишет %@ · вся глава
zh_hans: 代笔中%@ · 写整章
zh_hant: 代筆中%@ · 寫整章

# 代笔中%@ · 剧情同步
source: Ghostwriting%@ · Plot sync
ja: 代筆中%@ · ストーリー同期
ko: 대필 중%@ · 스토리 동기화
ru: Пишет %@ · синхронизация сюжета
zh_hans: 代笔中%@ · 剧情同步
zh_hant: 代筆中%@ · 劇情同步

# 代笔中%@ · 定向改写 %lld/%lld
source: Ghostwriting%@ · Targeted rewrite %lld/%lld
ja: 代筆中%@ · 指定リライト %lld/%lld
ko: 대필 중%@ · 지정 재작성 %lld/%lld
ru: Пишет %@ · переписывание %lld/%lld
zh_hans: 代笔中%@ · 定向改写 %lld/%lld
zh_hant: 代筆中%@ · 定向改寫 %lld/%lld

# 代笔中%@ · 审核并收录
source: Ghostwriting%@ · Review and adopt
ja: 代筆中%@ · 審査して収録
ko: 대필 중%@ · 검토 및 수록
ru: Пишет %@ · проверка и добавление
zh_hans: 代笔中%@ · 审核并收录
zh_hant: 代筆中%@ · 審核並收錄

# 代笔中%@ · 拟定计划
source: Ghostwriting%@ · Planning
ja: 代筆中%@ · 計画を作成
ko: 대필 중%@ · 계획 작성
ru: Пишет %@ · составление плана
zh_hans: 代笔中%@ · 拟定计划
zh_hant: 代筆中%@ · 擬定計畫

# 代笔中%@ · 按意见润修
source: Ghostwriting%@ · Revising from feedback
ja: 代筆中%@ · コメントに沿って推敲
ko: 대필 중%@ · 의견에 따라 다듬기
ru: Пишет %@ · доработка по замечаниям
zh_hans: 代笔中%@ · 按意见润修
zh_hant: 代筆中%@ · 按意見潤修

# 代笔中%@ · 自动收录
source: Ghostwriting%@ · Auto-adopting
ja: 代筆中%@ · 自動収録
ko: 대필 중%@ · 자동 수록
ru: Пишет %@ · автоматическое добавление
zh_hans: 代笔中%@ · 自动收录
zh_hant: 代筆中%@ · 自動收錄

# 代笔仅支持当前主分支
source: Ghostwriting is supported only on the current main branch
ja: 代筆は現在のメインブランチにのみ対応しています
ko: 대필은 현재 메인 브랜치에서만 지원됩니다.
ru: Дописание доступно только в главной ветке
zh_hans: 代笔仅支持当前主分支
zh_hant: 代筆僅支援目前主分支

# 代笔写整章前要先确认计划；代笔进行中不能改。
source: Confirm the plan before ghostwriting a full chapter; it can't be changed during ghostwriting.
ja: 章全体を代筆する前に計画を確認してください。代筆中は変更できません。
ko: 전체 장을 대필하기 전에 계획을 확인해야 하며, 대필 중에는 변경할 수 없습니다.
ru: Перед написанием всей главы нужно подтвердить план; во время написания его нельзя менять.
zh_hans: 代笔写整章前要先确认计划；代笔进行中不能改。
zh_hant: 代筆寫整章前要先確認計畫；代筆進行中不能修改。

# 代笔写整章前，请先在标题面板确认本章计划
source: Confirm this chapter's plan in the title panel before ghostwriting the full chapter
ja: 章全体を代筆する前に、タイトルパネルでこの章の計画を確認してください
ko: 전체 장을 대필하기 전에 제목 패널에서 이 장의 계획을 확인하세요.
ru: Перед написанием всей главы подтвердите план этой главы на панели заголовка
zh_hans: 代笔写整章前，请先在标题面板确认本章计划
zh_hant: 代筆寫整章前，請先在標題面板確認本章計畫

# 代笔写整章前，请先确认本章计划
source: Confirm this chapter's plan before ghostwriting the full chapter
ja: 章全体を代筆する前に、まず本章の計画を確認してください
ko: 전체 장을 대필하기 전에 이 장의 계획을 먼저 확인하세요.
ru: Перед полным написанием главы подтвердите её план
zh_hans: 代笔写整章前，请先确认本章计划
zh_hant: 代筆撰寫整章前，請先確認本章計畫

# 代笔失败%@
source: Ghostwriting failed%@
ja: 代筆に失敗しました%@
ko: 대필 실패%@
ru: Ошибка написания%@
zh_hans: 代笔失败%@
zh_hant: 代筆失敗%@

# 代笔已取消%@
source: Ghostwriting canceled%@
ja: 代筆をキャンセルしました%@
ko: 대필 취소됨%@
ru: Написание отменено%@
zh_hans: 代笔已取消%@
zh_hant: 代筆已取消%@

# 代笔已暂停%@
source: Ghostwriting paused%@
ja: 代筆を一時停止しました%@
ko: 대필 일시 중지됨%@
ru: Написание приостановлено%@
zh_hans: 代笔已暂停%@
zh_hant: 代筆已暫停%@

# 代笔已暂停%@ · 情节硬伤
source: Ghostwriting paused%@ · Plot issue
ja: 代筆を一時停止しました%@ · ストーリー上の重大な問題
ko: 대필 일시 중지됨%@ · 치명적 스토리 문제
ru: Написание приостановлено%@ · критическая ошибка сюжета
zh_hans: 代笔已暂停%@ · 情节硬伤
zh_hant: 代筆已暫停%@ · 情節硬傷

# 代笔已暂停%@ · 检查未稳
source: Ghostwriting paused%@ · Check inconclusive
ja: 代筆を一時停止しました%@ · チェック未確定
ko: 대필 일시 중지됨%@ · 검사 불안정
ru: Написание приостановлено%@ · проверка не завершена
zh_hans: 代笔已暂停%@ · 检查未稳
zh_hant: 代筆已暫停%@ · 檢查未穩

# 代笔待润修%@
source: Ghostwriting awaiting revision%@
ja: 代筆・推敲待ち%@
ko: 대필 다듬기 대기%@
ru: Написание ожидает доработки%@
zh_hans: 代笔待润修%@
zh_hant: 代筆待潤修%@

# 代笔暂时不能开始，请检查本章计划后重试。
source: Ghostwriting can't start yet. Check this chapter's plan and try again.
ja: 代筆を開始できません。章の計画を確認して再試行してください。
ko: 대필을 지금 시작할 수 없습니다. 이 장의 계획을 확인한 후 다시 시도하세요.
ru: Нельзя начать написание. Проверьте план этой главы и повторите попытку.
zh_hans: 代笔暂时不能开始，请检查本章计划后重试。
zh_hant: 代筆暫時無法開始，請檢查本章計畫後重試。

# 代笔条件尚未满足
source: Ghostwriting requirements not yet met
ja: 代筆条件を満たしていません
ko: 대필 조건이 아직 충족되지 않았습니다.
ru: Условия для написания от имени автора ещё не выполнены
zh_hans: 代笔条件尚未满足
zh_hant: 代筆條件尚未滿足

# 代笔模式
source: Ghostwriting mode
ja: 代筆モード
ko: 대필 모드
ru: Режим написания
zh_hans: 代笔模式
zh_hant: 代筆模式

# 代笔稿需通过审核后由代笔流程收录
source: The ghostwritten draft must pass review before the ghostwriting workflow can accept it
ja: 代筆原稿は審査後に代筆フローで収録されます
ko: 대필 원고는 검토를 통과한 후 대필 과정에서 수록됩니다.
ru: Текст от имени автора будет принят рабочим процессом только после проверки
zh_hans: 代笔稿需通过审核后由代笔流程收录
zh_hant: 代筆稿須通過審核後，才能由代筆流程收錄

# 代笔章数
source: Ghostwrite chapter count
ja: 代筆する章数
ko: 대필 장 수
ru: Количество глав для дописывания
zh_hans: 代笔章数
zh_hant: 代筆章數

# 代笔等待继续%@
source: Ghostwriting waiting to continue%@
ja: 代筆の続行待ち%@
ko: 대필 계속 대기%@
ru: Написание ожидает продолжения%@
zh_hans: 代笔等待继续%@
zh_hant: 代筆等待繼續%@

# 代笔计划审批
source: Ghostwriting plan approval
ja: 代筆計画の承認
ko: 대필 계획 승인
ru: Согласование плана написания
zh_hans: 代笔计划审批
zh_hant: 代筆計畫審批

# 代笔进度
source: Ghostwriting progress
ja: 代筆の進捗
ko: 대필 진행률
ru: Прогресс написания
zh_hans: 代笔进度
zh_hant: 代筆進度

# 代笔进行中
source: Ghostwriting in progress
ja: 代筆中
ko: 대필 진행 중
ru: Идёт написание
zh_hans: 代笔进行中
zh_hant: 代筆進行中

# 代笔进行中，可在下方暂停。
source: Ghostwriting in progress; you can pause it below.
ja: 代筆中です。下から一時停止できます。
ko: 대필 진행 중이며 아래에서 일시 중지할 수 있습니다.
ru: Идёт написание; приостановить можно ниже.
zh_hans: 代笔进行中，可在下方暂停。
zh_hant: 代筆進行中，可在下方暫停。

# 代笔进行中，暂停后可切回共创。
source: Ghostwriting in progress; pause to switch back to co-writing.
ja: 代筆中です。一時停止すると共同制作に戻れます。
ko: 대필 진행 중입니다. 일시 중지한 후 공동 창작으로 돌아갈 수 있습니다.
ru: Идёт написание, после паузы можно вернуться к совместной работе.
zh_hans: 代笔进行中，暂停后可切回共创。
zh_hant: 代筆進行中，暫停後可切回共創。

# 以下为通用处理方向，可按本次审稿意见选择并继续编辑；确认开始前不会改动候选稿或正文。
source: The following are general editing directions. Choose one based on this review and continue editing; nothing in the candidate draft or manuscript changes until you confirm.
ja: 以下は一般的な対応方針です。今回のレビューコメントに合わせて選択・編集を続けられます。開始を確認するまで、候補稿や本文は変更しません。
ko: 다음은 일반적인 처리 방향입니다. 이번 검토 의견에 따라 선택하고 계속 편집할 수 있습니다. 시작을 확인하기 전에는 후보 원고나 본문이 변경되지 않습니다.
ru: Ниже приведены общие варианты обработки. Выберите вариант по текущим замечаниям редактора и продолжите редактирование; до подтверждения черновик и основной текст не изменятся.
zh_hans: 以下为通用处理方向，可按本次审稿意见选择并继续编辑；确认开始前不会改动候选稿或正文。
zh_hant: 以下為通用處理方向，可依本次審稿意見選擇並繼續編輯；確認開始前不會變更候選稿或正文。

# 以下模块未能生成：%@。重新生成只重跑这些缺失段落。
source: The following modules failed to generate: %@. Regenerating will rerun only these missing sections.
ja: 以下のモジュールを生成できませんでした：%@。再生成では、これらの欠落した段落だけを再実行します。
ko: 다음 모듈을 생성하지 못했습니다: %@. 다시 생성하면 누락된 단락만 다시 실행합니다.
ru: Не удалось сгенерировать следующие модули: %@. Повторная генерация запустит только эти пропущенные фрагменты.
zh_hans: 以下模块未能生成：%@。重新生成只重跑这些缺失段落。
zh_hant: 以下模組無法產生：%@。重新產生只會重跑這些缺失段落。

# 以此为题重开
source: Restart with this title
ja: このタイトルで再開
ko: 이 제목으로 다시 시작
ru: Начать заново с этой темой
zh_hans: 以此为题重开
zh_hant: 以此為題重新開啟

# 任务
source: Task
ja: タスク
ko: 작업
ru: Задача
zh_hans: 任务
zh_hant: 任務

# 任务已结束
source: Task complete
ja: タスクが終了しました
ko: 작업 완료
ru: Задача завершена
zh_hans: 任务已结束
zh_hant: 任務已結束

# 优先级 %lld
source: Priority %lld
ja: 優先度 %lld
ko: 우선순위 %lld
ru: Приоритет %lld
zh_hans: 优先级 %lld
zh_hant: 優先順序 %lld

# 优先选择擅长长文与创意写作的模型
source: Prefer models skilled at long-form and creative writing
ja: 長文と創作に強いモデルを優先
ko: 긴 글과 창의적 글쓰기에 강한 모델 우선
ru: Предпочтительна модель для длинных текстов и творческого письма
zh_hans: 优先选择擅长长文与创意写作的模型
zh_hant: 優先選擇擅長長文與創意寫作的模型

# 优先选择稳定、便宜、结构化输出可靠的模型
source: Prefer models that are stable, affordable, and reliable at structured output
ja: 安定性・低コスト・構造化出力に優れたモデルを優先
ko: 안정적이고 저렴하며 구조화된 출력이 안정적인 모델 우선
ru: Предпочтительна стабильная, недорогая модель с надёжным структурированным выводом
zh_hans: 优先选择稳定、便宜、结构化输出可靠的模型
zh_hant: 優先選擇穩定、便宜、結構化輸出可靠的模型

# 会从当前分支的正文目录移除这一章，目录与生成都不再包含它。
source: This will remove the chapter from the current branch's manuscript directory; it will no longer be included in the directory or generation.
ja: 現在のブランチの本文目次からこの章を削除します。目次にも生成内容にも含まれなくなります。
ko: 현재 브랜치의 본문 목차에서 이 장을 삭제합니다. 목차와 생성 결과에 더 이상 포함되지 않습니다.
ru: Глава будет удалена из содержания текущей ветки и больше не войдёт в текст и генерацию.
zh_hans: 会从当前分支的正文目录移除这一章，目录与生成都不再包含它。
zh_hant: 會從目前分支的正文目錄移除這一章，目錄與產生結果都不再包含它。
